Autodesk.Revit.DB.Material.SurfacePatternId
The id of the FillPatternElement associated to normal views of faces with this material.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.Material.CutPatternId
The id of the FillPatternElement associated to cut views of faces with this material.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.Material.CutPatternColor
The color of the material cut pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.Material.SurfacePatternColor
The color of the material surface pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL